module.bootstrap.aws_dynamodb_table.tf_lock_state: Refreshing state... [id=ks-github-tf-aws]
aws_network_interface.gateway: Refreshing state... [id=eni-0853fea075ecf1a29]
module.bootstrap.aws_s3_bucket.state_bucket: Refreshing state... [id=ks-github-tf-aws]
aws_instance.vm1: Refreshing state... [id=i-00329515fbdee9bdf]
aws_eip.frontend: Refreshing state... [id=eipalloc-00ecc415a8e8eed61]
aws_route53_record.bench3: Refreshing state... [id=Z01092892MLURSVI2K4L4_bench3.usegvl.org_A]
local_file.ipfile: Refreshing state... [id=7e8803cb3446ccd556c93eab76acdf39ea5d64c9]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_route53_record.bench3 has been changed
  ~ resource "aws_route53_record" "bench3" {
        id      = "Z01092892MLURSVI2K4L4_bench3.usegvl.org_A"
        name    = "bench3.usegvl.org"
        # (5 unchanged attributes hidden)
    }
  # local_file.ipfile has been deleted
  - resource "local_file" "ipfile" {
      - content              = <<-EOT
            Your instance will be available shortly at: 34.231.202.100
            Use the SSH key ks-galaxy-aws that was provided to you, or ask ksuderman for the key.
            
        EOT -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0777" -> null
      - filename             = "./comment.txt" -> null
      - id                   = "7e8803cb3446ccd556c93eab76acdf39ea5d64c9" -> null
    }
  # aws_eip.frontend has been changed
  ~ resource "aws_eip" "frontend" {
        id                   = "eipalloc-00ecc415a8e8eed61"
      + tags                 = {}
        # (12 unchanged attributes hidden)
    }
  # aws_instance.vm1 has been changed
  ~ resource "aws_instance" "vm1" {
      ~ associate_public_ip_address          = false -> true
        id                                   = "i-00329515fbdee9bdf"
      + public_dns                           = "ec2-34-231-202-100.compute-1.amazonaws.com"
      + public_ip                            = "34.231.202.100"
      ~ tags                                 = {
          + "kubernetes.io/cluster/bench3.usegvl.org" = "owned"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                             = {
          + "kubernetes.io/cluster/bench3.usegvl.org" = "owned"
            # (2 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)





      ~ root_block_device {
          + tags                  = {}
            # (8 unchanged attributes hidden)
        }
        # (4 unchanged blocks hidden)
    }
  # aws_network_interface.gateway has been changed
  ~ resource "aws_network_interface" "gateway" {
        id                 = "eni-0853fea075ecf1a29"
        tags               = {
            "Name" = "primary_network_interface"
        }
        # (12 unchanged attributes hidden)

      + attachment {
          + attachment_id = "eni-attach-0b05dd69acc5c3769"
          + device_index  = 0
          + instance      = "i-00329515fbdee9bdf"
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_instance_profile.profile will be created
  + resource "aws_iam_instance_profile" "profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "profile"
      + path        = "/"
      + role        = "gha-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_policy.cn will be created
  + resource "aws_iam_policy" "cn" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "iam_trust_policy_cn"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com.cn"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_policy.policy will be created
  + resource "aws_iam_policy" "policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "iam_policy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "autoscaling:DescribeAutoScalingGroups",
                          + "autoscaling:DescribeLaunchConfigurations",
                          + "autoscaling:DescribeTags",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeRegions",
                          + "ec2:DescribeRouteTables",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeVolumes",
                          + "ec2:CreateSecurityGroup",
                          + "ec2:CreateTags",
                          + "ec2:CreateVolume",
                          + "ec2:ModifyInstanceAttribute",
                          + "ec2:ModifyVolume",
                          + "ec2:AttachVolume",
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:CreateRoute",
                          + "ec2:DeleteRoute",
                          + "ec2:DeleteSecurityGroup",
                          + "ec2:DeleteVolume",
                          + "ec2:DetachVolume",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInstanceTypes",
                          + "ec2:DescribeInstanceTypeOfferings",
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:AttachLoadBalancerToSubnets",
                          + "elasticloadbalancing:ApplySecurityGroupsToLoadBalancer",
                          + "elasticloadbalancing:CreateLoadBalancerPolicy",
                          + "elasticloadbalancing:CreateLoadBalancerListeners",
                          + "elasticloadbalancing:ConfigureHealthCheck",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:DeleteLoadBalancerListeners",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DetachLoadBalancerFromSubnets",
                          + "elasticloadbalancing:DeregisterInstancesFromLoadBalancer",
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:RegisterInstancesWithLoadBalancer",
                          + "elasticloadbalancing:SetLoadBalancerPoliciesForBackendServer",
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:CreateTargetGroup",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:DeleteTargetGroup",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeLoadBalancerPolicies",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:SetLoadBalancerPoliciesOfListener",
                          + "iam:CreateServiceLinkedRole",
                          + "kms:DescribeKey",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_policy.trust will be created
  + resource "aws_iam_policy" "trust" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "iam_trust_policy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_policy_attachment.cn-attach will be created
  + resource "aws_iam_policy_attachment" "cn-attach" {
      + id         = (known after apply)
      + name       = "cn-attachment"
      + policy_arn = (known after apply)
      + roles      = [
          + "gha-role",
        ]
    }

  # aws_iam_policy_attachment.policy-attach will be created
  + resource "aws_iam_policy_attachment" "policy-attach" {
      + id         = (known after apply)
      + name       = "policy-attachment"
      + policy_arn = (known after apply)
      + roles      = [
          + "gha-role",
        ]
    }

  # aws_iam_policy_attachment.trust-attach will be created
  + resource "aws_iam_policy_attachment" "trust-attach" {
      + id         = (known after apply)
      + name       = "trust-attachment"
      + policy_arn = (known after apply)
      + roles      = [
          + "gha-role",
        ]
    }

  # aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gha-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_instance.vm1 will be updated in-place
  ~ resource "aws_instance" "vm1" {
      + iam_instance_profile                 = "profile"
        id                                   = "i-00329515fbdee9bdf"
      ~ tags                                 = {
          - "kubernetes.io/cluster/bench3.usegvl.org" = "owned" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all                             = {
          - "kubernetes.io/cluster/bench3.usegvl.org" = "owned" -> null
            # (2 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # local_file.ipfile will be created
  + resource "local_file" "ipfile" {
      + content              = <<-EOT
            Your instance will be available shortly at: 34.231.202.100
            Use the SSH key ks-galaxy-aws that was provided to you, or ask ksuderman for the key.
            
        EOT
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./comment.txt"
      + id                   = (known after apply)
    }

Plan: 9 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.